; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-2-19-17)
(:domain gripper-strips)
(:objects robot1 robot2 - robot
rgripper1 lgripper1 rgripper2 lgripper2 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 room19 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 - object)
(:init
(at-robby robot1 room6)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room13)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at ball1 room6)
(at ball2 room13)
(at ball3 room18)
(at ball4 room14)
(at ball5 room4)
(at ball6 room4)
(at ball7 room4)
(at ball8 room1)
(at ball9 room9)
(at ball10 room2)
(at ball11 room15)
(at ball12 room16)
(at ball13 room11)
(at ball14 room19)
(at ball15 room6)
(at ball16 room4)
(at ball17 room9)
)
(:goal
(and
(at ball1 room2)
(at ball2 room5)
(at ball3 room1)
(at ball4 room12)
(at ball5 room11)
(at ball6 room18)
(at ball7 room4)
(at ball8 room18)
(at ball9 room7)
(at ball10 room10)
(at ball11 room7)
(at ball12 room3)
(at ball13 room16)
(at ball14 room1)
(at ball15 room9)
(at ball16 room9)
(at ball17 room18)
)
)
)

; plan
1. (pick robot2 ball2 room13 lgripper2)
   deleted: (at ball2 room13) (free robot2 lgripper2)
   added: (carry robot2 ball2 lgripper2)
   goals met: 1 of 17
2. (pick robot1 ball15 room6 lgripper1)
   deleted: (at ball15 room6) (free robot1 lgripper1)
   added: (carry robot1 ball15 lgripper1)
   goals met: 1 of 17
3. (pick robot1 ball1 room6 rgripper1)
   deleted: (at ball1 room6) (free robot1 rgripper1)
   added: (carry robot1 ball1 rgripper1)
   goals met: 1 of 17
4. (move robot2 room13 room5)
   deleted: (at-robby robot2 room13)
   added: (at-robby robot2 room5)
   goals met: 1 of 17
5. (move robot1 room6 room4)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room4)
   goals met: 1 of 17
6. (drop robot2 ball2 room5 lgripper2)
   deleted: (carry robot2 ball2 lgripper2)
   added: (at ball2 room5) (free robot2 lgripper2)
   goals met: 2 of 17
7. (move robot1 room4 room3)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room3)
   goals met: 2 of 17
8. (move robot2 room5 room14)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room14)
   goals met: 2 of 17
9. (move robot1 room3 room9)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room9)
   goals met: 2 of 17
10. (pick robot2 ball4 room14 lgripper2)
   deleted: (at ball4 room14) (free robot2 lgripper2)
   added: (carry robot2 ball4 lgripper2)
   goals met: 2 of 17
11. (drop robot1 ball15 room9 lgripper1)
   deleted: (carry robot1 ball15 lgripper1)
   added: (at ball15 room9) (free robot1 lgripper1)
   goals met: 3 of 17
12. (move robot2 room14 room12)
   deleted: (at-robby robot2 room14)
   added: (at-robby robot2 room12)
   goals met: 3 of 17
13. (move robot1 room9 room2)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room2)
   goals met: 3 of 17
14. (drop robot2 ball4 room12 lgripper2)
   deleted: (carry robot2 ball4 lgripper2)
   added: (at ball4 room12) (free robot2 lgripper2)
   goals met: 4 of 17
15. (drop robot1 ball1 room2 rgripper1)
   deleted: (carry robot1 ball1 rgripper1)
   added: (at ball1 room2) (free robot1 rgripper1)
   goals met: 5 of 17
16. (pick robot1 ball10 room2 lgripper1)
   deleted: (at ball10 room2) (free robot1 lgripper1)
   added: (carry robot1 ball10 lgripper1)
   goals met: 5 of 17
17. (move robot1 room2 room10)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room10)
   goals met: 5 of 17
18. (move robot2 room12 room1)
   deleted: (at-robby robot2 room12)
   added: (at-robby robot2 room1)
   goals met: 5 of 17
19. (drop robot1 ball10 room10 lgripper1)
   deleted: (carry robot1 ball10 lgripper1)
   added: (at ball10 room10) (free robot1 lgripper1)
   goals met: 6 of 17
20. (pick robot2 ball8 room1 lgripper2)
   deleted: (at ball8 room1) (free robot2 lgripper2)
   added: (carry robot2 ball8 lgripper2)
   goals met: 6 of 17
21. (move robot2 room1 room18)
   deleted: (at-robby robot2 room1)
   added: (at-robby robot2 room18)
   goals met: 6 of 17
22. (move robot1 room10 room7)
   deleted: (at-robby robot1 room10)
   added: (at-robby robot1 room7)
   goals met: 6 of 17
23. (move robot1 room7 room9)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room9)
   goals met: 6 of 17
24. (drop robot2 ball8 room18 lgripper2)
   deleted: (carry robot2 ball8 lgripper2)
   added: (at ball8 room18) (free robot2 lgripper2)
   goals met: 7 of 17
25. (pick robot2 ball3 room18 rgripper2)
   deleted: (at ball3 room18) (free robot2 rgripper2)
   added: (carry robot2 ball3 rgripper2)
   goals met: 7 of 17
26. (move robot2 room18 room19)
   deleted: (at-robby robot2 room18)
   added: (at-robby robot2 room19)
   goals met: 7 of 17
27. (pick robot1 ball9 room9 lgripper1)
   deleted: (at ball9 room9) (free robot1 lgripper1)
   added: (carry robot1 ball9 lgripper1)
   goals met: 7 of 17
28. (pick robot1 ball17 room9 rgripper1)
   deleted: (at ball17 room9) (free robot1 rgripper1)
   added: (carry robot1 ball17 rgripper1)
   goals met: 7 of 17
29. (pick robot2 ball14 room19 lgripper2)
   deleted: (at ball14 room19) (free robot2 lgripper2)
   added: (carry robot2 ball14 lgripper2)
   goals met: 7 of 17
30. (move robot1 room9 room7)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room7)
   goals met: 7 of 17
31. (move robot2 room19 room1)
   deleted: (at-robby robot2 room19)
   added: (at-robby robot2 room1)
   goals met: 7 of 17
32. (drop robot1 ball9 room7 lgripper1)
   deleted: (carry robot1 ball9 lgripper1)
   added: (at ball9 room7) (free robot1 lgripper1)
   goals met: 8 of 17
33. (drop robot2 ball3 room1 rgripper2)
   deleted: (carry robot2 ball3 rgripper2)
   added: (at ball3 room1) (free robot2 rgripper2)
   goals met: 9 of 17
34. (drop robot2 ball14 room1 lgripper2)
   deleted: (carry robot2 ball14 lgripper2)
   added: (at ball14 room1) (free robot2 lgripper2)
   goals met: 10 of 17
35. (move robot1 room7 room9)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room9)
   goals met: 10 of 17
36. (move robot2 room1 room15)
   deleted: (at-robby robot2 room1)
   added: (at-robby robot2 room15)
   goals met: 10 of 17
37. (move robot1 room9 room18)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room18)
   goals met: 10 of 17
38. (pick robot2 ball11 room15 lgripper2)
   deleted: (at ball11 room15) (free robot2 lgripper2)
   added: (carry robot2 ball11 lgripper2)
   goals met: 10 of 17
39. (drop robot1 ball17 room18 rgripper1)
   deleted: (carry robot1 ball17 rgripper1)
   added: (at ball17 room18) (free robot1 rgripper1)
   goals met: 11 of 17
40. (move robot2 room15 room7)
   deleted: (at-robby robot2 room15)
   added: (at-robby robot2 room7)
   goals met: 11 of 17
41. (move robot1 room18 room4)
   deleted: (at-robby robot1 room18)
   added: (at-robby robot1 room4)
   goals met: 11 of 17
42. (drop robot2 ball11 room7 lgripper2)
   deleted: (carry robot2 ball11 lgripper2)
   added: (at ball11 room7) (free robot2 lgripper2)
   goals met: 12 of 17
43. (pick robot1 ball6 room4 lgripper1)
   deleted: (at ball6 room4) (free robot1 lgripper1)
   added: (carry robot1 ball6 lgripper1)
   goals met: 12 of 17
44. (pick robot1 ball16 room4 rgripper1)
   deleted: (at ball16 room4) (free robot1 rgripper1)
   added: (carry robot1 ball16 rgripper1)
   goals met: 12 of 17
45. (move robot1 room4 room9)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room9)
   goals met: 12 of 17
46. (move robot2 room7 room4)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room4)
   goals met: 12 of 17
47. (drop robot1 ball16 room9 rgripper1)
   deleted: (carry robot1 ball16 rgripper1)
   added: (at ball16 room9) (free robot1 rgripper1)
   goals met: 13 of 17
48. (pick robot2 ball5 room4 lgripper2)
   deleted: (at ball5 room4) (free robot2 lgripper2)
   added: (carry robot2 ball5 lgripper2)
   goals met: 13 of 17
49. (move robot1 room9 room18)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room18)
   goals met: 13 of 17
50. (move robot2 room4 room16)
   deleted: (at-robby robot2 room4)
   added: (at-robby robot2 room16)
   goals met: 13 of 17
51. (drop robot1 ball6 room18 lgripper1)
   deleted: (carry robot1 ball6 lgripper1)
   added: (at ball6 room18) (free robot1 lgripper1)
   goals met: 14 of 17
52. (pick robot2 ball12 room16 rgripper2)
   deleted: (at ball12 room16) (free robot2 rgripper2)
   added: (carry robot2 ball12 rgripper2)
   goals met: 14 of 17
53. (move robot2 room16 room3)
   deleted: (at-robby robot2 room16)
   added: (at-robby robot2 room3)
   goals met: 14 of 17
54. (move robot1 room18 room16)
   deleted: (at-robby robot1 room18)
   added: (at-robby robot1 room16)
   goals met: 14 of 17
55. (drop robot2 ball12 room3 rgripper2)
   deleted: (carry robot2 ball12 rgripper2)
   added: (at ball12 room3) (free robot2 rgripper2)
   goals met: 15 of 17
56. (move robot1 room16 room11)
   deleted: (at-robby robot1 room16)
   added: (at-robby robot1 room11)
   goals met: 15 of 17
57. (move robot2 room3 room11)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room11)
   goals met: 15 of 17
58. (pick robot1 ball13 room11 lgripper1)
   deleted: (at ball13 room11) (free robot1 lgripper1)
   added: (carry robot1 ball13 lgripper1)
   goals met: 15 of 17
59. (drop robot2 ball5 room11 lgripper2)
   deleted: (carry robot2 ball5 lgripper2)
   added: (at ball5 room11) (free robot2 lgripper2)
   goals met: 16 of 17
60. (move robot1 room11 room16)
   deleted: (at-robby robot1 room11)
   added: (at-robby robot1 room16)
   goals met: 16 of 17
61. (drop robot1 ball13 room16 lgripper1)
   deleted: (carry robot1 ball13 lgripper1)
   added: (at ball13 room16) (free robot1 lgripper1)
   goals met: 17 of 17
